<template>
  <div class="main-page" style="height: 100%;">
    <md-doc :text="text" toc-pos="right"></md-doc>
  </div>
</template>

<script>
import MdDoc from '../../source/MdDoc';

export default {
  components: { MdDoc },
  data() {
    return {
      text: `# 基座
## ferm3-ui-common
ferm3 通用基座

---

## 版本说明

### 0.1.5 (2018-12-19)
- bug 修复

### 0.1.4 (2018-12-19)
- 优化滚动条样式
- 新增修改密码支持
- 支持独立页面路由
- 锁屏改用hui实现
- 支持超时自动锁屏
- 消息中心支持单个消息的已读和删除操作

### 0.1.3 (2018-12-17)
- 优化滚动条样式及IE9下logo样式

### 0.1.2 (2018-12-13)
- 新增锁屏功能

### 0.1.1 (2018-12-13)
- 新增消息中心

### 0.1.0 (2018-12-10)
- 更新依赖

### 0.0.15 (2018-12-04)
- 修复菜单顺序问题

### 0.0.14 (2018-12-04)
- 去除默认用户名和密码

### 0.0.13 (2018-12-04)
- 顶栏下拉菜单问题修复

### 0.0.12 (2018-12-03)
- 登录页面样式优化

### 0.0.11 (2018-12-03)
- 支持系统名自定义

### 0.0.10 (2018-12-03)
- 部分问题修复

### 0.0.9 (2018-11-30)
- 菜单支持副标题
- 路由生成方式优化
- 新的 keep-alive 缓存规则

### 0.0.8 (2018-11-29)
- 修复页面样式问题

### 0.0.6 (2018-11-28)
- 修复路由跳转问题

### 0.0.5 (2018-11-28)
- 去除 jQuery

### 0.0.4 (2018-11-27)
- bug 修复

### 0.0.3 (2018-11-27)
- 菜单搜索支持
- 屏蔽未实现功能

### 0.0.2 (2018-11-26)
- 新增通用基座服务代码`
    }
  }
}
</script>

<style>
</style>
